---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet{System.Int32})
source: html/310a9e9f-2a07-5af5-8160-581441bd2e90.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	ISet<int> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.ISet < Int32 >`)